<template>
  <q-page padding>
    <h3>Δημιουργία και παραμετροποίηση Βάσεων Δεδομένων Βιοποικιλότητας, Γεωχωρικών Δεδομένων και Ανθρωπογενών πιέσεων</h3>
Το έργο συγχρηματοδοτείται από την Ελλάδα και την
Ευρωπαϊκή Ένωση μέσω του Ταμείου Συνοχής (ΤΣ), στο
πλαίσιο του Ε.Π. «Υποδομές Μεταφορών, Περιβάλλον και
Αειφόρος Ανάπτυξη 2014-2020» (ΕΠ ΥΜΕΠΕΡΑΑ), από τις
πιστώσεις του Προγράμματος Δημοσίων Επενδύσεων, κωδ.
ΣΑΕ 2020ΣΕ27510043, ΣΕ2751. Υλοποιείται στο πλαίσιο του
Υποέργου Νο 1 «Εφαρμογή της Διαχείρισης Ειδών,
Οικοτόπων και Περιοχών Natura 2000 του Φορέα
Διαχείρισης Εθνικού Δρυμού Αίνου με Στόχο τη Βελτίωση της
Κατάστασης Διατήρησης και την Προστασία», της Πράξης
«Επιχορήγηση του Φορέα Διαχείρισης Εθνικού Δρυμού
Αίνου για Δράσεις Διαχείρισης Προστατευόμενων Περιοχών,
Ειδών και Οικοτόπων» (κωδ. ΟΠΣ 5033022), η οποία έχει
ενταχθεί στο ΕΠ ΥΜΕΠΕΡΑΑ με την απόφαση ένταξης με αρ.
πρωτ. 2987/01-04-2020 (ΑΔΑ: Ω0Α146ΜΤΛΡ-Ε5Π) της
Ειδικής
Υπηρεσίας
Διαχείρισης
Επιχειρησιακού
Προγράμματος «Υποδομές Μεταφορών, Περιβάλλον και
Αειφόρος Ανάπτυξη», του Υπουργείου Ανάπτυξης και
Επενδύσεων/
Ειδική
Γραμματεία
Διαχείρισης
Προγραμμάτων Ευρωπαϊκού Ταμείου Περιφερειακής
Ανάπτυξης, Ταμείου Συνοχής και Ευρωπαϊκού Κοινωνικού
Ταμείου.
  </q-page>
</template>

<script>
export default {
  name: 'Projectinfo',
}
</script>
